Repository: shinploidsukei/VHelp
Catalog: lib/l10n/app_*.arb
Languages: th

# language
source: English
th: ไทย

# title_VHelp
source: VHelp
th: วีเฮลป์

# topic1
source: What is depression?
th: ภาวะซึมเศร้าคืออะไร?

# topic2
source: Hotline
th: สายด่วน

# topic3
source: Causes and Effects of Depression
th: สาเหตุและผลกระทบของภาวะซึมเศร้า

# topic4
source: Depression Symptoms and Warning Signs
th: อาการซึมเศร้าและสัญญาณเตือน

# topic5
source: How to deal with depression when you feel blue
th: วิธีรับมือกับภาวะซึมเศร้า

# content1
source: Depression (major depressive disorder) is a common and serious medical illness that negatively affects how you feel, the way you think and how you act. Fortunately, it is also treatable. Depression causes feelings of sadness and/or a loss of interest in activities you once enjoyed. It can lead to a variety of emotional and physical problems and can decrease your ability to function at work and at home.
th: อาการซึมเศร้า (โรคซึมเศร้าขั้นรุนแรง) เป็นโรคทางการแพทย์ที่พบได้บ่อยและร้ายแรง ซึ่งส่งผลกระทบในทางลบต่อความรู้สึกของคุณ วิธีคิด และการกระทำของคุณ โชคดีที่ยังสามารถรักษาได้ อาการซึมเศร้าทำให้เกิดความรู้สึกเศร้าหรือหมดความสนใจในกิจกรรมที่คุณเคยชอบ มันสามารถนำไปสู่ปัญหาทางอารมณ์และร่างกายที่หลากหลาย และอาจทำให้ความสามารถในการทำงานของคุณลดลง

# topic1_1
source: Depression Symptoms
th: อาการซึมเศร้า

# content1_1
source: • Feeling sad or having a depressed mood • Loss of interest or pleasure in activities once enjoyed • Changes in appetite — weight loss or gain unrelated to dieting • Trouble sleeping or sleeping too much • Loss of energy or increased fatigue • Increase in purposeless physical activity (e.g., inability to sit still, pacing, handwringing) or slowed movements or speech (these actions must be severe enough to be observable by others) • Feeling worthless or guilty • Difficulty thinking, concentrating or making decisions • Thoughts of death or suicide
th: • รู้สึกเศร้าหรือหดหู่ • หมดความสนใจ หรือสนุกสนานกับกิจกรรมที่เคยเพลิดเพลิน • ความอยากอาหารเปลี่ยนแปลง — น้ำหนักลดหรือเพิ่มไม่เกี่ยวข้องกับการอดอาหาร • มีปัญหาในการนอน หรือนอนมากเกินไป • สูญเสียพลังงาน หรือความเหนื่อยล้าเพิ่มขึ้น • การเคลื่อนไหวโดยไร้จุดหมาย (เช่น ไม่สามารถนั่งนิ่ง เว้นจังหวะ โบกมือ) การเคลื่อนไหวหรือการพูดช้าลง (การกระทำเหล่านี้ต้องรุนแรงพอที่จะให้ผู้อื่นสังเกตได้) • รู้สึกไร้ค่าหรือรู้สึกผิด • มีปัญหาในการคิด สมาธิ หรือตัดสินใจ • คิดถึงความตาย หรือการฆ่าตัวตาย

# readbutton
source: Read More
th: อ่านต่อ

# content2
source: Department of Mental Health Hotline 1323 will provide people with fast and effective mental health counseling. In the future, Thai people will be in good mental health and happy. The number of lines on the Mental Health Hotline 1323 will be increased to accommodate the growing demand.
th: สายด่วนกรมสุขภาพจิต 1323 จะให้คำปรึกษาด้านสุขภาพจิตแก่ประชาชนอย่างรวดเร็ว และมีประสิทธิภาพ ในอนาคตคนไทยจะมีสุขภาพจิตที่ดีและมีความสุข จำนวนสายด่วนสุขภาพจิตเบอร์ 1323 จะเพิ่มขึ้นเพื่อรองรับความต้องการที่เพิ่มขึ้น

# callbutton
source: Call
th: โทร

# websitebutton
source: Website
th: เว็บไซต์

# topic2_1
source: Department of Mental Health
th: กรมสุขภาพจิต

# content3
source: Many potential causes for depression exist. It can be genetic, meaning the patient has a family history of depression. Personal trauma and sources of stress, such as a failed relationship or a lost job, can also cause depression. Social isolation as the result of conflict with family and friends can be a contributory factor, and certain medications, such as high blood pressure medication, have depression listed as a possible side effect.
th: มีหลายสาเหตุที่เป็นไปได้สำหรับภาวะซึมเศร้า อาจเป็นพันธุกรรม ซึ่งหมายความว่าผู้ป่วยมีประวัติครอบครัวเป็นโรคซึมเศร้า การบาดเจ็บส่วนบุคคล และแหล่งที่มาของความเครียด เช่น ความสัมพันธ์ที่ล้มเหลว หรือการตกงาน อาจทำให้เกิดภาวะซึมเศร้าได้เช่นกัน การแยกตัวทางสังคมอันเป็นผลมาจากความขัดแย้งกับครอบครัว และเพื่อนฝูงอาจเป็นปัจจัยสนับสนุน หรือยาบางชนิด เช่น ยารักษาโรคความดันโลหิตสูง ซึ่งอาการซึมเศร้าระบุว่าเป็นผลข้างเคียงที่อาจเกิดขึ้นได้

# content4
source: Depression varies from person to person, but there are some common signs and symptoms. It’s important to remember that these symptoms can be part of life’s normal lows. But the more symptoms you have, the stronger they are, and the longer they’ve lasted—the more likely it is that you’re dealing with depression.
th: อาการซึมเศร้าแตกต่างกันไปในแต่ละบุคคล แต่มีอาการและอาการแสดงทั่วไป สิ่งสำคัญคือต้องจำไว้ว่าอาการเหล่านี้อาจเป็นส่วนหนึ่งของภาวะปกติของชีวิต แต่ยิ่งคุณมีอาการมากเท่าไหร่ ก็ยิ่งแข็งแกร่งขึ้นเท่านั้น และยิ่งนานขึ้นเท่าไร ก็ยิ่งมีโอกาสที่คุณจะเป็นโรคซึมเศร้ามากขึ้นเท่านั้น

# content5
source: There are a range of ways to deal with depression, and often they are best used in conjunction with each other. The primary medical options are Cognitive Behavioural Therapy (CBT), antidepressant medication, and in some severe cases, Electroconvulsive Therapy (ECT). Education and coping strategies are also important when learning to manage your depression.
th: มีหลายวิธีในการจัดการกับภาวะซึมเศร้า และมักจะใช้ร่วมกันได้ดีที่สุด ตัวเลือกทางการแพทย์เบื้องต้น ได้แก่ Cognitive Behavioral Therapy (CBT) ยาต้านอาการซึมเศร้า และในบางกรณีที่รุนแรง การบำบัดด้วยไฟฟ้า (ECT) กลยุทธ์การศึกษาและการเผชิญปัญหาก็มีความสำคัญเช่นกันเมื่อต้องการที่จะจัดการกับภาวะซึมเศร้าของคุณ

# sidebar1
source: Timestamp
th: ตารางการทานยา

# sidebar2
source: Doctor Notification
th: การแจ้งเตือนหาหมอ

# sidebar3
source: Medicine Notification
th: การแจ้งเตือนทานยา

# sidebar4
source: Diary
th: ไดอารี่

# sidebar5
source: Calendar
th: ปฏิทิน

# sidebar6
source: Art Therapy
th: การบำบัดด้วยศิลปะ

# sidebar7
source: Music Therapy
th: การบำบัดด้วยดนตรี

# sidebar8
source: Podcast
th: พอตแคสต์

# sidebar1_topic
source: My Timestamp
th: ตารางทานยาของฉัน

# timestamp_button1
source: Take Medicine
th: รับประทานยา

# timestamp_button2
source: Timestamp Log
th: บันทึกการทานยา

source: Warning!
th: คำเตือน!

# warning_message
source: Please take the medicines by following the prescription seriously. Overdose means lethal action!
th: โปรดใช้ยาตามใบสั่งแพทย์อย่างเคร่งครัด ยาเกินขนาดหมายถึงการกระทำที่ร้ายแรง!

source: Cancel
th: ยกเลิก

source: OK
th: โอเค

# mission1
source: Challenge Mission
th: ภารกิจท้าทาย

# mission_message1
source: Listen to the relaxing song!
th: ฟังเพลงคลายเครียด!

source: Done
th: เรียบร้อย

# mission_message2
source: Draw some pictures!
th: วาดรูปสักรูป!

# mission_message3
source: Watch relaxing movie!
th: ดูหนังคลายเครียด!

# mission_message4
source: Go for a Walk!
th: ไปเดินเล่น!

# mission_message5
source: Keep Going!
th: จงทำต่อไป!

source: Good Jobs
th: ดีมาก

# timestamp_log_topic
source: My Timestamp Log
th: บันทึกการทานยาของฉัน

# timestamp_log_message
source: Add your Timestamp by clicking take medicine..
th: เพิ่มตารางทานยาของคุณโดยคลิกรับประทานยา..

source: Total Logs:
th: รายการบันทึกทานยาทั้งหมด:

# mood_diary
source: My Mood Diary
th: ไดอารี่อารมณ์ของฉัน

# mood_diary_message
source: Add some mood..
th: เพิ่มอารมณ์..

# mood_diary_button1
source: Add Diary
th: เพิ่มไดอารี่

# mood_diary_button2
source: Add Mood
th: เพิ่มอารมณ์

# diary
source: My Diary
th: ไดอารี่ของฉัน

# diary_message
source: Add some stories..
th: เพิ่มเรื่องราว..

source: Title
th: ชื่อเรื่อง

# title_message
source: Type something...
th: พิมบางอย่าง..

source: Date
th: วัน

source: Time
th: เวลา

# notiword
source: Notification Word
th: คำที่ใช้แจ้งเตือน

# mednoti_hinttext
source: playing football
th: เล่นฟุตบอล

source: Confirm
th: ยืนยัน

# mednoti_warning
source: Warning! Please put in every single field.
th: คำเตือน! กรุณาใส่ให้ครบทุกช่อง

# mednoti_success
source: Successfully Set Notification!
th: ตั้งค่าแจ้งเตือนเรียบร้อยแล้ว!

source: Random Words
th: สุ่มคำแจ้งเตือน

source: Select Date
th: เลือกวัน

source: Select Time
th: เลือกเวลา

source: Loading...
th: กำลังโหลด...

# playlist_name
source: Stomp's Playlist
th: เพลย์ลิสต์ของ Stomp

source: Ajarn Yord
th: อาจารย์ยอด

# pipe
source: Pipe Lao Rueng Phee
th: ไปป์เล่าเรื่องผี
